/* platinum.c -- âàø âåñ â ïëàòèíîâîì ýêâèâàëåíòå */
#include <stdio.h>
int main(void)
{
    float weight;   /* âåñ ïîëüçîâàòåëÿ */
    float value;    /* ïëàòèíîâûé ýêâèâàëåíò */

    printf("Õîòèòå óçíàòü ñâîé âåñ â ïëàòèíîâîì ýêâèâàëåíòå?\n");
    printf("Äàâàéòå ïîäñ÷èòàåì.\n");
    printf("Ïîæàëóéñòà, ââåäèòå ñâîé âåñ, âûðàæåííûé â ôóíòàõ: ");

    /* ïîëó÷èòü âõîäíûå äàííûå îò ïîëüçîâàòåëÿ */
    scanf("%f", &weight);
    /* ñ÷èòàåì, ÷òî öåíà ðîäèÿ ðàâíà $1700 çà òðîéñêóþ óíöèþ */
    /* 14.5833 êîýôôèöèåíò äëÿ ïåðåâîäà âåñà, âûðàæåííîãî â ôóíòàõ, â òðîéñêèå óíöèè */
    value = 1700.0 * weight * 14.5833;
    printf("Âàø âåñ â ïëàòèíîâîì ýêâèâàëåíòå ñîñòàâëÿåò $%.2f.\n", value);
    printf("Âû ëåãêî ìîæåòå ñòàòü äîñòîéíûì ýòîãî! Åñëè öåíà ïëàòèíû ïàäàåò,\n");
    printf("åøüòå áîëüøå äëÿ ïîääåðæàíèÿ ñâîåé ñòîèìîñòè.\n");

    return 0;
}
